zst123/Element14_Low-Power-IoT/mtb_shared/mtb-hal-cat1/release-v1.6.0/COMPONENT_PSOC6HAL/COMPONENT_CAT1B/source/pin_packages/cyhal_mxs28playermcuss_128_tqfp.c
/***************************************************************************//**
* \file cyhal_mxs28playermcuss_128_tqfp.c
*
* \brief
* MXS28PLAYERMCUSS device GPIO HAL header for 128-TQFP package
*
* \note
* Generator version: 1.6.0.512
*
********************************************************************************
* \copyright
* Copyright 2016-2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cyhal_hw_types.h"

#if defined(_GPIO_MXS28PLAYERMCUSS_128_TQFP_H_)
#include "pin_packages/cyhal_mxs28playermcuss_128_tqfp.h"

/* Hardware Blocks */
static const cyhal_resource_inst_t CYHAL_BLESS_0 = { CYHAL_RSC_BLESS, 0, 0 };
static const cyhal_resource_inst_t CYHAL_ETH_0 = { CYHAL_RSC_ETH, 0, 0 };
static const cyhal_resource_inst_t CYHAL_I3C_0 = { CYHAL_RSC_I3C, 0, 0 };
static const cyhal_resource_inst_t CYHAL_PDM_0_0 = { CYHAL_RSC_PDM, 0, 0 };
static const cyhal_resource_inst_t CYHAL_PDM_0_1 = { CYHAL_RSC_PDM, 0, 1 };
static const cyhal_resource_inst_t CYHAL_PDM_0_2 = { CYHAL_RSC_PDM, 0, 2 };
static const cyhal_resource_inst_t CYHAL_SCB_0 = { CYHAL_RSC_SCB, 0, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_1 = { CYHAL_RSC_SCB, 1, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_2 = { CYHAL_RSC_SCB, 2, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_3 = { CYHAL_RSC_SCB, 3, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_4 = { CYHAL_RSC_SCB, 4, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_5 = { CYHAL_RSC_SCB, 5, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_6 = { CYHAL_RSC_SCB, 6, 0 };
static const cyhal_resource_inst_t CYHAL_SCB_7 = { CYHAL_RSC_SCB, 7, 0 };
static const cyhal_resource_inst_t CYHAL_SDHC_1 = { CYHAL_RSC_SDHC, 1, 0 };
static const cyhal_resource_inst_t CYHAL_SDIODEV_0 = { CYHAL_RSC_SDIODEV, 0, 0 };
static const cyhal_resource_inst_t CYHAL_SMIF_0 = { CYHAL_RSC_SMIF, 0, 0 };
static const cyhal_resource_inst_t CYHAL_TCPWM_0_0 = { CYHAL_RSC_TCPWM, 0, 0 };
static const cyhal_resource_inst_t CYHAL_TCPWM_0_1 = { CYHAL_RSC_TCPWM, 0, 1 };
static const cyhal_resource_inst_t CYHAL_TCPWM_0_2 = { CYHAL_RSC_TCPWM, 0, 2 };
static const cyhal_resource_inst_t CYHAL_TCPWM_0_3 = { CYHAL_RSC_TCPWM, 0, 3 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_0 = { CYHAL_RSC_TCPWM, 1, 0 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_1 = { CYHAL_RSC_TCPWM, 1, 1 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_10 = { CYHAL_RSC_TCPWM, 1, 10 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_11 = { CYHAL_RSC_TCPWM, 1, 11 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_12 = { CYHAL_RSC_TCPWM, 1, 12 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_13 = { CYHAL_RSC_TCPWM, 1, 13 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_14 = { CYHAL_RSC_TCPWM, 1, 14 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_15 = { CYHAL_RSC_TCPWM, 1, 15 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_2 = { CYHAL_RSC_TCPWM, 1, 2 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_3 = { CYHAL_RSC_TCPWM, 1, 3 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_4 = { CYHAL_RSC_TCPWM, 1, 4 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_5 = { CYHAL_RSC_TCPWM, 1, 5 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_6 = { CYHAL_RSC_TCPWM, 1, 6 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_7 = { CYHAL_RSC_TCPWM, 1, 7 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_8 = { CYHAL_RSC_TCPWM, 1, 8 };
static const cyhal_resource_inst_t CYHAL_TCPWM_1_9 = { CYHAL_RSC_TCPWM, 1, 9 };
static const cyhal_resource_inst_t CYHAL_TDM_0 = { CYHAL_RSC_TDM, 0, 0 };

/* Pin connections */
/* Connections for: bless_ext_lna_rx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_ext_lna_rx_ctl[1] = {
    {&CYHAL_BLESS_0, P0_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_5_BLESS_EXT_LNA_RX_CTL},
};

/* Connections for: bless_ext_pa_lna_chip_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_ext_pa_lna_chip_en[1] = {
    {&CYHAL_BLESS_0, P5_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_7_BLESS_EXT_PA_LNA_CHIP_EN},
};

/* Connections for: bless_ext_pa_tx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_ext_pa_tx_ctl[1] = {
    {&CYHAL_BLESS_0, P5_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_6_BLESS_EXT_PA_TX_CTL},
};

/* Connections for: bless_mxd_act_bpktctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_act_bpktctl[1] = {
    {&CYHAL_BLESS_0, P16_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_3_BLESS_MXD_ACT_BPKTCTL},
};

/* Connections for: bless_mxd_act_dbus_rx_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_act_dbus_rx_en[1] = {
    {&CYHAL_BLESS_0, P16_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_1_BLESS_MXD_ACT_DBUS_RX_EN},
};

/* Connections for: bless_mxd_act_dbus_tx_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_act_dbus_tx_en[1] = {
    {&CYHAL_BLESS_0, P16_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_2_BLESS_MXD_ACT_DBUS_TX_EN},
};

/* Connections for: bless_mxd_act_txd_rxd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_act_txd_rxd[1] = {
    {&CYHAL_BLESS_0, P16_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_4_BLESS_MXD_ACT_TXD_RXD},
};

/* Connections for: bless_mxd_dpslp_act_ldo_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_act_ldo_en[1] = {
    {&CYHAL_BLESS_0, P15_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_6_BLESS_MXD_DPSLP_ACT_LDO_EN},
};

