zst123/Element14_Low-Power-IoT/mtb_shared/mtb-hal-cat1/release-v1.6.0/COMPONENT_PSOC6HAL/COMPONENT_CAT1B/source/pin_packages/cyhal_mxs28playermcuss_128_tqfp.c
/* Connections for: bless_mxd_dpslp_buck_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_buck_en[1] = {
    {&CYHAL_BLESS_0, P15_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_2_BLESS_MXD_DPSLP_BUCK_EN},
};

/* Connections for: bless_mxd_dpslp_clk_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_clk_en[1] = {
    {&CYHAL_BLESS_0, P15_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_4_BLESS_MXD_DPSLP_CLK_EN},
};

/* Connections for: bless_mxd_dpslp_dig_ldo_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_dig_ldo_en[1] = {
    {&CYHAL_BLESS_0, P16_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_0_BLESS_MXD_DPSLP_DIG_LDO_EN},
};

/* Connections for: bless_mxd_dpslp_isolate_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_isolate_n[1] = {
    {&CYHAL_BLESS_0, P15_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_5_BLESS_MXD_DPSLP_ISOLATE_N},
};

/* Connections for: bless_mxd_dpslp_mxd_clk_out */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_mxd_clk_out[1] = {
    {&CYHAL_BLESS_0, P4_3, (uint8_t)CY_GPIO_DM_HIGHZ, P4_3_BLESS_MXD_DPSLP_MXD_CLK_OUT},
};

/* Connections for: bless_mxd_dpslp_rcb_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_rcb_clk[1] = {
    {&CYHAL_BLESS_0, P4_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_0_BLESS_MXD_DPSLP_RCB_CLK},
};

/* Connections for: bless_mxd_dpslp_rcb_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_rcb_data[1] = {
    {&CYHAL_BLESS_0, P16_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_5_BLESS_MXD_DPSLP_RCB_DATA},
};

/* Connections for: bless_mxd_dpslp_rcb_le */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_rcb_le[1] = {
    {&CYHAL_BLESS_0, P4_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_1_BLESS_MXD_DPSLP_RCB_LE},
};

/* Connections for: bless_mxd_dpslp_reset_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_reset_n[1] = {
    {&CYHAL_BLESS_0, P15_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_3_BLESS_MXD_DPSLP_RESET_N},
};

/* Connections for: bless_mxd_dpslp_ret_ldo_ol_hv */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_ret_ldo_ol_hv[1] = {
    {&CYHAL_BLESS_0, P15_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_1_BLESS_MXD_DPSLP_RET_LDO_OL_HV},
};

/* Connections for: bless_mxd_dpslp_ret_switch_hv */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_ret_switch_hv[1] = {
    {&CYHAL_BLESS_0, P15_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_0_BLESS_MXD_DPSLP_RET_SWITCH_HV},
};

/* Connections for: bless_mxd_dpslp_xtal_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_bless_mxd_dpslp_xtal_en[1] = {
    {&CYHAL_BLESS_0, P15_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_7_BLESS_MXD_DPSLP_XTAL_EN},
};

/* Connections for: eth_eth_tsu_timer_cmp_val */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_eth_tsu_timer_cmp_val[1] = {
    {&CYHAL_ETH_0, P12_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_4_ETH0_ETH_TSU_TIMER_CMP_VAL},
};

/* Connections for: eth_mdc */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdc[1] = {
    {&CYHAL_ETH_0, P12_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_6_ETH0_MDC},
};

/* Connections for: eth_mdio */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdio[1] = {
    {&CYHAL_ETH_0, P12_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_7_ETH0_MDIO},
};

/* Connections for: eth_ref_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_ref_clk[1] = {
    {&CYHAL_ETH_0, P13_7, (uint8_t)CY_GPIO_DM_HIGHZ, P13_7_ETH0_REF_CLK},
};

/* Connections for: eth_rx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_ctl[1] = {
    {&CYHAL_ETH_0, P2_0, (uint8_t)CY_GPIO_DM_HIGHZ, P2_0_ETH0_RX_CTL},
};

/* Connections for: eth_rx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_er[1] = {
    {&CYHAL_ETH_0, P12_3, (uint8_t)CY_GPIO_DM_HIGHZ, P12_3_ETH0_RX_ER},
};

/* Connections for: eth_rxd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rxd[2] = {
    {&CYHAL_ETH_0, P2_1, (uint8_t)CY_GPIO_DM_HIGHZ, P2_1_ETH0_RXD0},
    {&CYHAL_ETH_0, P2_2, (uint8_t)CY_GPIO_DM_HIGHZ, P2_2_ETH0_RXD1},
};

/* Connections for: eth_tx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_clk[1] = {
    {&CYHAL_ETH_0, P13_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_7_ETH0_TX_CLK},
};

/* Connections for: eth_tx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_ctl[1] = {
    {&CYHAL_ETH_0, P2_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_5_ETH0_TX_CTL},
};

/* Connections for: eth_txd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_txd[2] = {
    {&CYHAL_ETH_0, P2_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_3_ETH0_TXD0},
    {&CYHAL_ETH_0, P2_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_4_ETH0_TXD1},
};

/* Connections for: i3c_i3c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_i3c_i3c_scl[1] = {
    {&CYHAL_I3C_0, P11_0, (uint8_t)CY_GPIO_DM_OD_DRIVESLOW, P11_0_I3C_I3C_SCL},
};

/* Connections for: i3c_i3c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_i3c_i3c_sda[1] = {
    {&CYHAL_I3C_0, P11_1, (uint8_t)CY_GPIO_DM_OD_DRIVESLOW, P11_1_I3C_I3C_SDA},
};

/* Connections for: i3c_i3c_sda_pullup_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_i3c_i3c_sda_pullup_en[2] = {
    {&CYHAL_I3C_0, P9_3, (uint8_t)CY_GPIO_DM_OD_DRIVESLOW, P9_3_I3C_I3C_SDA_PULLUP_EN},
    {&CYHAL_I3C_0, P10_1, (uint8_t)CY_GPIO_DM_OD_DRIVESLOW, P10_1_I3C_I3C_SDA_PULLUP_EN},
};

/* Connections for: pdm_pdm_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pdm_pdm_clk[5] = {
    {&CYHAL_PDM_0_1, P2_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_0_PDM_PDM_CLK1},
    {&CYHAL_PDM_0_1, P5_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_6_PDM_PDM_CLK1},
    {&CYHAL_PDM_0_0, P6_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_2_PDM_PDM_CLK0},
    {&CYHAL_PDM_0_0, P12_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_6_PDM_PDM_CLK0},
    {&CYHAL_PDM_0_2, P15_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_0_PDM_PDM_CLK2},
};

/* Connections for: pdm_pdm_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pdm_pdm_data[5] = {
    {&CYHAL_PDM_0_1, P2_1, (uint8_t)CY_GPIO_DM_HIGHZ, P2_1_PDM_PDM_DATA1},
    {&CYHAL_PDM_0_1, P5_7, (uint8_t)CY_GPIO_DM_HIGHZ, P5_7_PDM_PDM_DATA1},
    {&CYHAL_PDM_0_0, P6_3, (uint8_t)CY_GPIO_DM_HIGHZ, P6_3_PDM_PDM_DATA0},
    {&CYHAL_PDM_0_0, P12_7, (uint8_t)CY_GPIO_DM_HIGHZ, P12_7_PDM_PDM_DATA0},
    {&CYHAL_PDM_0_2, P15_1, (uint8_t)CY_GPIO_DM_HIGHZ, P15_1_PDM_PDM_DATA2},
};

/* Connections for: peri_tr_io_input */
/* Since the GPIO pin is already specified there is no need to specify a particular resource for every entry.
   Instead set the resource_inst field to the index of the input or output trigger line. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_input[28] = {
    {(cyhal_resource_inst_t*)0, P0_0, (uint8_t)CY_GPIO_DM_HIGHZ, P0_0_PERI_TR_IO_INPUT0},
    {(cyhal_resource_inst_t*)1, P0_1, (uint8_t)CY_GPIO_DM_HIGHZ, P0_1_PERI_TR_IO_INPUT1},
    {(cyhal_resource_inst_t*)2, P0_2, (uint8_t)CY_GPIO_DM_HIGHZ, P0_2_PERI_TR_IO_INPUT2},
    {(cyhal_resource_inst_t*)3, P0_3, (uint8_t)CY_GPIO_DM_HIGHZ, P0_3_PERI_TR_IO_INPUT3},
    {(cyhal_resource_inst_t*)4, P2_0, (uint8_t)CY_GPIO_DM_HIGHZ, P2_0_PERI_TR_IO_INPUT4},
    {(cyhal_resource_inst_t*)5, P2_1, (uint8_t)CY_GPIO_DM_HIGHZ, P2_1_PERI_TR_IO_INPUT5},
    {(cyhal_resource_inst_t*)8, P4_0, (uint8_t)CY_GPIO_DM_HIGHZ, P4_0_PERI_TR_IO_INPUT8},
    {(cyhal_resource_inst_t*)9, P4_1, (uint8_t)CY_GPIO_DM_HIGHZ, P4_1_PERI_TR_IO_INPUT9},
    {(cyhal_resource_inst_t*)10, P5_6, (uint8_t)CY_GPIO_DM_HIGHZ, P5_6_PERI_TR_IO_INPUT10},
    {(cyhal_resource_inst_t*)11, P5_7, (uint8_t)CY_GPIO_DM_HIGHZ, P5_7_PERI_TR_IO_INPUT11},
    {(cyhal_resource_inst_t*)12, P6_4, (uint8_t)CY_GPIO_DM_HIGHZ, P6_4_PERI_TR_IO_INPUT12},
    {(cyhal_resource_inst_t*)13, P6_5, (uint8_t)CY_GPIO_DM_HIGHZ, P6_5_PERI_TR_IO_INPUT13},
    {(cyhal_resource_inst_t*)14, P7_0, (uint8_t)CY_GPIO_DM_HIGHZ, P7_0_PERI_TR_IO_INPUT14},
    {(cyhal_resource_inst_t*)15, P7_1, (uint8_t)CY_GPIO_DM_HIGHZ, P7_1_PERI_TR_IO_INPUT15},
    {(cyhal_resource_inst_t*)16, P8_0, (uint8_t)CY_GPIO_DM_HIGHZ, P8_0_PERI_TR_IO_INPUT16},
    {(cyhal_resource_inst_t*)17, P8_1, (uint8_t)CY_GPIO_DM_HIGHZ, P8_1_PERI_TR_IO_INPUT17},
    {(cyhal_resource_inst_t*)18, P9_0, (uint8_t)CY_GPIO_DM_HIGHZ, P9_0_PERI_TR_IO_INPUT18},
    {(cyhal_resource_inst_t*)19, P9_1, (uint8_t)CY_GPIO_DM_HIGHZ, P9_1_PERI_TR_IO_INPUT19},
    {(cyhal_resource_inst_t*)20, P10_0, (uint8_t)CY_GPIO_DM_HIGHZ, P10_0_PERI_TR_IO_INPUT20},
    {(cyhal_resource_inst_t*)21, P10_1, (uint8_t)CY_GPIO_DM_HIGHZ, P10_1_PERI_TR_IO_INPUT21},
    {(cyhal_resource_inst_t*)22, P11_0, (uint8_t)CY_GPIO_DM_HIGHZ, P11_0_PERI_TR_IO_INPUT22},
    {(cyhal_resource_inst_t*)23, P11_1, (uint8_t)CY_GPIO_DM_HIGHZ, P11_1_PERI_TR_IO_INPUT23},
    {(cyhal_resource_inst_t*)24, P12_0, (uint8_t)CY_GPIO_DM_HIGHZ, P12_0_PERI_TR_IO_INPUT24},
    {(cyhal_resource_inst_t*)25, P12_1, (uint8_t)CY_GPIO_DM_HIGHZ, P12_1_PERI_TR_IO_INPUT25},
    {(cyhal_resource_inst_t*)26, P13_0, (uint8_t)CY_GPIO_DM_HIGHZ, P13_0_PERI_TR_IO_INPUT26},
    {(cyhal_resource_inst_t*)27, P13_1, (uint8_t)CY_GPIO_DM_HIGHZ, P13_1_PERI_TR_IO_INPUT27},
    {(cyhal_resource_inst_t*)6, P16_2, (uint8_t)CY_GPIO_DM_HIGHZ, P16_2_PERI_TR_IO_INPUT6},
    {(cyhal_resource_inst_t*)7, P16_3, (uint8_t)CY_GPIO_DM_HIGHZ, P16_3_PERI_TR_IO_INPUT7},
};

