zst123/Element14_Low-Power-IoT/mtb_shared/mtb-hal-cat1/release-v1.6.0/COMPONENT_PSOC6HAL/COMPONENT_CAT1B/source/pin_packages/cyhal_mxs28playermcuss_128_tqfp.c
/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[12] = {
    {&CYHAL_SCB_1, P2_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_2_SCB1_UART_RTS},
    {&CYHAL_SCB_7, P4_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_2_SCB7_UART_RTS},
    {&CYHAL_SCB_3, P6_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_2_SCB3_UART_RTS},
    {&CYHAL_SCB_6, P6_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_6_SCB6_UART_RTS},
    {&CYHAL_SCB_4, P7_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_2_SCB4_UART_RTS},
    {&CYHAL_SCB_4, P8_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_2_SCB4_UART_RTS},
    {&CYHAL_SCB_2, P9_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_2_SCB2_UART_RTS},
    {&CYHAL_SCB_1, P10_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_2_SCB1_UART_RTS},
    {&CYHAL_SCB_5, P11_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_2_SCB5_UART_RTS},
    {&CYHAL_SCB_6, P12_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_2_SCB6_UART_RTS},
    {&CYHAL_SCB_6, P13_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_2_SCB6_UART_RTS},
    {&CYHAL_SCB_5, P15_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_4_SCB5_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[12] = {
    {&CYHAL_SCB_1, P2_0, (uint8_t)CY_GPIO_DM_HIGHZ, P2_0_SCB1_UART_RX},
    {&CYHAL_SCB_7, P4_0, (uint8_t)CY_GPIO_DM_HIGHZ, P4_0_SCB7_UART_RX},
    {&CYHAL_SCB_3, P6_0, (uint8_t)CY_GPIO_DM_HIGHZ, P6_0_SCB3_UART_RX},
    {&CYHAL_SCB_6, P6_4, (uint8_t)CY_GPIO_DM_HIGHZ, P6_4_SCB6_UART_RX},
    {&CYHAL_SCB_4, P7_0, (uint8_t)CY_GPIO_DM_HIGHZ, P7_0_SCB4_UART_RX},
    {&CYHAL_SCB_4, P8_0, (uint8_t)CY_GPIO_DM_HIGHZ, P8_0_SCB4_UART_RX},
    {&CYHAL_SCB_2, P9_0, (uint8_t)CY_GPIO_DM_HIGHZ, P9_0_SCB2_UART_RX},
    {&CYHAL_SCB_1, P10_0, (uint8_t)CY_GPIO_DM_HIGHZ, P10_0_SCB1_UART_RX},
    {&CYHAL_SCB_5, P11_0, (uint8_t)CY_GPIO_DM_HIGHZ, P11_0_SCB5_UART_RX},
    {&CYHAL_SCB_6, P12_0, (uint8_t)CY_GPIO_DM_HIGHZ, P12_0_SCB6_UART_RX},
    {&CYHAL_SCB_6, P13_0, (uint8_t)CY_GPIO_DM_HIGHZ, P13_0_SCB6_UART_RX},
    {&CYHAL_SCB_5, P15_2, (uint8_t)CY_GPIO_DM_HIGHZ, P15_2_SCB5_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[12] = {
    {&CYHAL_SCB_1, P2_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_1_SCB1_UART_TX},
    {&CYHAL_SCB_7, P4_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_1_SCB7_UART_TX},
    {&CYHAL_SCB_3, P6_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_1_SCB3_UART_TX},
    {&CYHAL_SCB_6, P6_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_5_SCB6_UART_TX},
    {&CYHAL_SCB_4, P7_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_1_SCB4_UART_TX},
    {&CYHAL_SCB_4, P8_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_1_SCB4_UART_TX},
    {&CYHAL_SCB_2, P9_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_1_SCB2_UART_TX},
    {&CYHAL_SCB_1, P10_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_1_SCB1_UART_TX},
    {&CYHAL_SCB_5, P11_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_1_SCB5_UART_TX},
    {&CYHAL_SCB_6, P12_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_1_SCB6_UART_TX},
    {&CYHAL_SCB_6, P13_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_1_SCB6_UART_TX},
    {&CYHAL_SCB_5, P15_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_3_SCB5_UART_TX},
};

/* Connections for: sdhc_card_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_cmd[1] = {
    {&CYHAL_SDHC_1, P12_1, (uint8_t)CY_GPIO_DM_STRONG, P12_1_SDHC1_CARD_CMD},
};

/* Connections for: sdhc_card_dat_3to0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_3to0[4] = {
    {&CYHAL_SDHC_1, P12_2, (uint8_t)CY_GPIO_DM_STRONG, P12_2_SDHC1_CARD_DAT_3TO00},
    {&CYHAL_SDHC_1, P12_3, (uint8_t)CY_GPIO_DM_STRONG, P12_3_SDHC1_CARD_DAT_3TO01},
    {&CYHAL_SDHC_1, P12_4, (uint8_t)CY_GPIO_DM_STRONG, P12_4_SDHC1_CARD_DAT_3TO02},
    {&CYHAL_SDHC_1, P12_5, (uint8_t)CY_GPIO_DM_STRONG, P12_5_SDHC1_CARD_DAT_3TO03},
};

/* Connections for: sdhc_card_dat_7to4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_7to4[4] = {
    {&CYHAL_SDHC_1, P13_4, (uint8_t)CY_GPIO_DM_STRONG, P13_4_SDHC1_CARD_DAT_7TO40},
    {&CYHAL_SDHC_1, P13_5, (uint8_t)CY_GPIO_DM_STRONG, P13_5_SDHC1_CARD_DAT_7TO41},
    {&CYHAL_SDHC_1, P13_6, (uint8_t)CY_GPIO_DM_STRONG, P13_6_SDHC1_CARD_DAT_7TO42},
    {&CYHAL_SDHC_1, P13_7, (uint8_t)CY_GPIO_DM_STRONG, P13_7_SDHC1_CARD_DAT_7TO43},
};

/* Connections for: sdhc_card_detect_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_detect_n[1] = {
    {&CYHAL_SDHC_1, P12_7, (uint8_t)CY_GPIO_DM_HIGHZ, P12_7_SDHC1_CARD_DETECT_N},
};

/* Connections for: sdhc_card_emmc_reset_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_emmc_reset_n[1] = {
    {&CYHAL_SDHC_1, P12_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_6_SDHC1_CARD_EMMC_RESET_N},
};

/* Connections for: sdhc_card_if_pwr_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_if_pwr_en[1] = {
    {&CYHAL_SDHC_1, P13_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_2_SDHC1_CARD_IF_PWR_EN},
};

/* Connections for: sdhc_card_mech_write_prot */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_mech_write_prot[1] = {
    {&CYHAL_SDHC_1, P13_0, (uint8_t)CY_GPIO_DM_HIGHZ, P13_0_SDHC1_CARD_MECH_WRITE_PROT},
};

/* Connections for: sdhc_clk_card */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_clk_card[1] = {
    {&CYHAL_SDHC_1, P12_0, (uint8_t)CY_GPIO_DM_STRONG, P12_0_SDHC1_CLK_CARD},
};

/* Connections for: sdhc_io_volt_sel */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_io_volt_sel[1] = {
    {&CYHAL_SDHC_1, P13_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_3_SDHC1_IO_VOLT_SEL},
};

/* Connections for: sdhc_led_ctrl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_led_ctrl[1] = {
    {&CYHAL_SDHC_1, P13_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_1_SDHC1_LED_CTRL},
};

/* Connections for: sdiodev_sdio_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdiodev_sdio_clk[1] = {
    {&CYHAL_SDIODEV_0, P2_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_5_SDIODEV0_SDIO_CLK},
};

/* Connections for: sdiodev_sdio_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdiodev_sdio_cmd[1] = {
    {&CYHAL_SDIODEV_0, P2_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_4_SDIODEV0_SDIO_CMD},
};

/* Connections for: sdiodev_sdio_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdiodev_sdio_data[4] = {
    {&CYHAL_SDIODEV_0, P2_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_0_SDIODEV0_SDIO_DATA0},
    {&CYHAL_SDIODEV_0, P2_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_1_SDIODEV0_SDIO_DATA1},
    {&CYHAL_SDIODEV_0, P2_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_2_SDIODEV0_SDIO_DATA2},
    {&CYHAL_SDIODEV_0, P2_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_3_SDIODEV0_SDIO_DATA3},
};

/* Connections for: smif_spi_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_clk[1] = {
    {&CYHAL_SMIF_0, P11_7, (uint8_t)CY_GPIO_DM_STRONG, P11_7_SMIF_SPIHB_CLK},
};

