zst123/Element14_Low-Power-IoT/mtb_shared/mtb-hal-cat1/release-v1.6.0/COMPONENT_PSOC6HAL/COMPONENT_CAT1B/source/pin_packages/cyhal_mxs28playermcuss_128_tqfp.c
/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {&CYHAL_SMIF_0, P11_6, (uint8_t)CY_GPIO_DM_STRONG, P11_6_SMIF_SPIHB_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {&CYHAL_SMIF_0, P11_5, (uint8_t)CY_GPIO_DM_STRONG, P11_5_SMIF_SPIHB_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {&CYHAL_SMIF_0, P11_4, (uint8_t)CY_GPIO_DM_STRONG, P11_4_SMIF_SPIHB_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {&CYHAL_SMIF_0, P11_3, (uint8_t)CY_GPIO_DM_STRONG, P11_3_SMIF_SPIHB_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[1] = {
    {&CYHAL_SMIF_0, P12_0, (uint8_t)CY_GPIO_DM_STRONG, P12_0_SMIF_SPIHB_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[1] = {
    {&CYHAL_SMIF_0, P12_1, (uint8_t)CY_GPIO_DM_STRONG, P12_1_SMIF_SPIHB_DATA5},
};

/* Connections for: smif_spi_data6 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data6[1] = {
    {&CYHAL_SMIF_0, P12_2, (uint8_t)CY_GPIO_DM_STRONG, P12_2_SMIF_SPIHB_DATA6},
};

/* Connections for: smif_spi_data7 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data7[1] = {
    {&CYHAL_SMIF_0, P12_3, (uint8_t)CY_GPIO_DM_STRONG, P12_3_SMIF_SPIHB_DATA7},
};

/* Connections for: smif_spi_rwds */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_rwds[1] = {
    {&CYHAL_SMIF_0, P12_5, (uint8_t)CY_GPIO_DM_STRONG, P12_5_SMIF_SPIHB_RWDS},
};

/* Connections for: smif_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select0[1] = {
    {&CYHAL_SMIF_0, P11_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_2_SMIF_SPIHB_SELECT0},
};

/* Connections for: smif_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select1[1] = {
    {&CYHAL_SMIF_0, P11_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_1_SMIF_SPIHB_SELECT1},
};

/* Connections for: smif_spi_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select2[1] = {
    {&CYHAL_SMIF_0, P11_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_0_SMIF_SPIHB_SELECT2},
};

/* Connections for: smif_spi_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_select3[1] = {
    {&CYHAL_SMIF_0, P12_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_4_SMIF_SPIHB_SELECT3},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[84] = {
    {&CYHAL_TCPWM_0_0, P0_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_0_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_0, P0_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_0_TCPWM1_LINE0},
    {&CYHAL_TCPWM_0_1, P0_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_2_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_1, P0_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_2_TCPWM1_LINE1},
    {&CYHAL_TCPWM_0_2, P0_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_4_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_2, P0_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_4_TCPWM1_LINE2},
    {&CYHAL_TCPWM_0_3, P2_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_7, P2_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_0_TCPWM1_LINE7},
    {&CYHAL_TCPWM_0_0, P2_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_8, P2_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_2_TCPWM1_LINE8},
    {&CYHAL_TCPWM_0_1, P2_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_9, P2_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_4_TCPWM1_LINE9},
    {&CYHAL_TCPWM_0_2, P4_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_0_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_10, P4_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_0_TCPWM1_LINE10},
    {&CYHAL_TCPWM_0_3, P4_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_2_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_11, P4_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_2_TCPWM1_LINE11},
    {&CYHAL_TCPWM_0_0, P5_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_6_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_12, P5_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_6_TCPWM1_LINE12},
    {&CYHAL_TCPWM_0_1, P6_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_0_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_13, P6_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_0_TCPWM1_LINE13},
    {&CYHAL_TCPWM_0_2, P6_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_2_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_14, P6_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_2_TCPWM1_LINE14},
    {&CYHAL_TCPWM_0_3, P6_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_4_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_15, P6_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_4_TCPWM1_LINE15},
    {&CYHAL_TCPWM_0_0, P6_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_6_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_0, P6_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_6_TCPWM1_LINE0},
    {&CYHAL_TCPWM_0_1, P7_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_0_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_1, P7_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_0_TCPWM1_LINE1},
    {&CYHAL_TCPWM_0_2, P7_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_2_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_2, P7_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_2_TCPWM1_LINE2},
    {&CYHAL_TCPWM_0_3, P7_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_4_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_3, P7_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_4_TCPWM1_LINE3},
    {&CYHAL_TCPWM_0_0, P7_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_6_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_4, P7_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_6_TCPWM1_LINE4},
    {&CYHAL_TCPWM_0_1, P8_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_0_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_5, P8_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_0_TCPWM1_LINE5},
    {&CYHAL_TCPWM_0_2, P8_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_2_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_6, P8_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_2_TCPWM1_LINE6},
    {&CYHAL_TCPWM_0_3, P9_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_7, P9_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_0_TCPWM1_LINE7},
    {&CYHAL_TCPWM_0_0, P9_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_8, P9_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_2_TCPWM1_LINE8},
    {&CYHAL_TCPWM_0_1, P10_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_0_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_9, P10_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_0_TCPWM1_LINE9},
    {&CYHAL_TCPWM_0_2, P10_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_2_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_10, P10_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_2_TCPWM1_LINE10},
    {&CYHAL_TCPWM_0_3, P11_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_11, P11_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_0_TCPWM1_LINE11},
    {&CYHAL_TCPWM_0_0, P11_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_12, P11_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_2_TCPWM1_LINE12},
    {&CYHAL_TCPWM_0_1, P11_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_13, P11_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_4_TCPWM1_LINE13},
    {&CYHAL_TCPWM_0_2, P11_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_6_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_14, P11_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_6_TCPWM1_LINE14},
    {&CYHAL_TCPWM_0_3, P12_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_15, P12_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_0_TCPWM1_LINE15},
    {&CYHAL_TCPWM_0_0, P12_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_0, P12_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_2_TCPWM1_LINE0},
    {&CYHAL_TCPWM_0_1, P12_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_1, P12_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_4_TCPWM1_LINE1},
    {&CYHAL_TCPWM_0_2, P12_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_6_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_2, P12_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_6_TCPWM1_LINE2},
    {&CYHAL_TCPWM_0_3, P13_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_3, P13_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_0_TCPWM1_LINE3},
    {&CYHAL_TCPWM_0_0, P13_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_4, P13_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_2_TCPWM1_LINE4},
    {&CYHAL_TCPWM_0_1, P13_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_5, P13_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_4_TCPWM1_LINE5},
    {&CYHAL_TCPWM_0_2, P13_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_6_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_6, P13_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_6_TCPWM1_LINE6},
    {&CYHAL_TCPWM_0_3, P15_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_3, P15_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_0_TCPWM1_LINE3},
    {&CYHAL_TCPWM_0_0, P15_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_4, P15_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_2_TCPWM1_LINE4},
    {&CYHAL_TCPWM_0_1, P15_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_5, P15_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_4_TCPWM1_LINE5},
    {&CYHAL_TCPWM_0_2, P15_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_6_TCPWM0_LINE2},
    {&CYHAL_TCPWM_1_6, P15_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_6_TCPWM1_LINE6},
    {&CYHAL_TCPWM_0_3, P16_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_0_TCPWM0_LINE3},
    {&CYHAL_TCPWM_1_7, P16_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_0_TCPWM1_LINE7},
    {&CYHAL_TCPWM_0_0, P16_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_2_TCPWM0_LINE0},
    {&CYHAL_TCPWM_1_8, P16_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_2_TCPWM1_LINE8},
    {&CYHAL_TCPWM_0_1, P16_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_4_TCPWM0_LINE1},
    {&CYHAL_TCPWM_1_9, P16_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_4_TCPWM1_LINE9},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[84] = {
    {&CYHAL_TCPWM_0_0, P0_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_1_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_0, P0_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_1_TCPWM1_LINE_COMPL0},
    {&CYHAL_TCPWM_0_1, P0_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_3_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_1, P0_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_3_TCPWM1_LINE_COMPL1},
    {&CYHAL_TCPWM_0_2, P0_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_5_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_2, P0_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P0_5_TCPWM1_LINE_COMPL2},
    {&CYHAL_TCPWM_0_3, P2_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_7, P2_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_1_TCPWM1_LINE_COMPL7},
    {&CYHAL_TCPWM_0_0, P2_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_8, P2_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_3_TCPWM1_LINE_COMPL8},
    {&CYHAL_TCPWM_0_1, P2_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_9, P2_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P2_5_TCPWM1_LINE_COMPL9},
    {&CYHAL_TCPWM_0_2, P4_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_1_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_10, P4_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_1_TCPWM1_LINE_COMPL10},
    {&CYHAL_TCPWM_0_3, P4_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_3_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_11, P4_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P4_3_TCPWM1_LINE_COMPL11},
    {&CYHAL_TCPWM_0_0, P5_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_7_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_12, P5_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P5_7_TCPWM1_LINE_COMPL12},
    {&CYHAL_TCPWM_0_1, P6_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_1_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_13, P6_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_1_TCPWM1_LINE_COMPL13},
    {&CYHAL_TCPWM_0_2, P6_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_3_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_14, P6_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_3_TCPWM1_LINE_COMPL14},
    {&CYHAL_TCPWM_0_3, P6_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_5_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_15, P6_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_5_TCPWM1_LINE_COMPL15},
    {&CYHAL_TCPWM_0_0, P6_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_7_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_0, P6_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P6_7_TCPWM1_LINE_COMPL0},
    {&CYHAL_TCPWM_0_1, P7_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_1_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_1, P7_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_1_TCPWM1_LINE_COMPL1},
    {&CYHAL_TCPWM_0_2, P7_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_3_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_2, P7_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_3_TCPWM1_LINE_COMPL2},
    {&CYHAL_TCPWM_0_3, P7_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_5_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_3, P7_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_5_TCPWM1_LINE_COMPL3},
    {&CYHAL_TCPWM_0_0, P7_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_7_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_4, P7_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P7_7_TCPWM1_LINE_COMPL4},
    {&CYHAL_TCPWM_0_1, P8_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_1_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_5, P8_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_1_TCPWM1_LINE_COMPL5},
    {&CYHAL_TCPWM_0_2, P8_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_3_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_6, P8_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_3_TCPWM1_LINE_COMPL6},
    {&CYHAL_TCPWM_0_3, P9_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_7, P9_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_1_TCPWM1_LINE_COMPL7},
    {&CYHAL_TCPWM_0_0, P9_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_8, P9_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_3_TCPWM1_LINE_COMPL8},
    {&CYHAL_TCPWM_0_1, P10_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_1_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_9, P10_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_1_TCPWM1_LINE_COMPL9},
    {&CYHAL_TCPWM_0_2, P10_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_3_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_10, P10_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P10_3_TCPWM1_LINE_COMPL10},
    {&CYHAL_TCPWM_0_3, P11_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_11, P11_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_1_TCPWM1_LINE_COMPL11},
    {&CYHAL_TCPWM_0_0, P11_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_12, P11_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_3_TCPWM1_LINE_COMPL12},
    {&CYHAL_TCPWM_0_1, P11_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_13, P11_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_5_TCPWM1_LINE_COMPL13},
    {&CYHAL_TCPWM_0_2, P11_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_7_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_14, P11_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P11_7_TCPWM1_LINE_COMPL14},
    {&CYHAL_TCPWM_0_3, P12_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_15, P12_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_1_TCPWM1_LINE_COMPL15},
    {&CYHAL_TCPWM_0_0, P12_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_0, P12_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_3_TCPWM1_LINE_COMPL0},
    {&CYHAL_TCPWM_0_1, P12_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_1, P12_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_5_TCPWM1_LINE_COMPL1},
    {&CYHAL_TCPWM_0_2, P12_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_7_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_2, P12_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P12_7_TCPWM1_LINE_COMPL2},
    {&CYHAL_TCPWM_0_3, P13_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_3, P13_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_1_TCPWM1_LINE_COMPL3},
    {&CYHAL_TCPWM_0_0, P13_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_4, P13_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_3_TCPWM1_LINE_COMPL4},
    {&CYHAL_TCPWM_0_1, P13_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_5, P13_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_5_TCPWM1_LINE_COMPL5},
    {&CYHAL_TCPWM_0_2, P13_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_7_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_6, P13_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_7_TCPWM1_LINE_COMPL6},
    {&CYHAL_TCPWM_0_3, P15_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_3, P15_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_1_TCPWM1_LINE_COMPL3},
    {&CYHAL_TCPWM_0_0, P15_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_4, P15_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_3_TCPWM1_LINE_COMPL4},
    {&CYHAL_TCPWM_0_1, P15_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_5, P15_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_5_TCPWM1_LINE_COMPL5},
    {&CYHAL_TCPWM_0_2, P15_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_7_TCPWM0_LINE_COMPL2},
    {&CYHAL_TCPWM_1_6, P15_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_7_TCPWM1_LINE_COMPL6},
    {&CYHAL_TCPWM_0_3, P16_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_1_TCPWM0_LINE_COMPL3},
    {&CYHAL_TCPWM_1_7, P16_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_1_TCPWM1_LINE_COMPL7},
    {&CYHAL_TCPWM_0_0, P16_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_3_TCPWM0_LINE_COMPL0},
    {&CYHAL_TCPWM_1_8, P16_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_3_TCPWM1_LINE_COMPL8},
    {&CYHAL_TCPWM_0_1, P16_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_5_TCPWM0_LINE_COMPL1},
    {&CYHAL_TCPWM_1_9, P16_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_5_TCPWM1_LINE_COMPL9},
};

/* Connections for: tdm_tdm_rx_fsync */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_fsync[3] = {
    {&CYHAL_TDM_0, P9_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_1_TDM_TDM_RX_FSYNC0},
    {&CYHAL_TDM_0, P13_5, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_5_TDM_TDM_RX_FSYNC1},
    {&CYHAL_TDM_0, P16_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_3_TDM_TDM_RX_FSYNC1},
};

/* Connections for: tdm_tdm_rx_mck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_mck[3] = {
    {&CYHAL_TDM_0, P8_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_0_TDM_TDM_RX_MCK0},
    {&CYHAL_TDM_0, P13_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_0_TDM_TDM_RX_MCK1},
    {&CYHAL_TDM_0, P15_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_6_TDM_TDM_RX_MCK1},
};

