zst123/Element14_Low-Power-IoT/mtb_shared/mtb-hal-cat1/release-v1.6.0/COMPONENT_PSOC6HAL/COMPONENT_CAT1B/source/pin_packages/cyhal_mxs28playermcuss_128_tqfp.c
/* Connections for: tdm_tdm_rx_sck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_sck[3] = {
    {&CYHAL_TDM_0, P9_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P9_0_TDM_TDM_RX_SCK0},
    {&CYHAL_TDM_0, P13_4, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_4_TDM_TDM_RX_SCK1},
    {&CYHAL_TDM_0, P16_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_2_TDM_TDM_RX_SCK1},
};

/* Connections for: tdm_tdm_rx_sd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_sd[3] = {
    {&CYHAL_TDM_0, P9_2, (uint8_t)CY_GPIO_DM_HIGHZ, P9_2_TDM_TDM_RX_SD0},
    {&CYHAL_TDM_0, P13_6, (uint8_t)CY_GPIO_DM_HIGHZ, P13_6_TDM_TDM_RX_SD1},
    {&CYHAL_TDM_0, P16_4, (uint8_t)CY_GPIO_DM_HIGHZ, P16_4_TDM_TDM_RX_SD1},
};

/* Connections for: tdm_tdm_tx_fsync */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_fsync[3] = {
    {&CYHAL_TDM_0, P8_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_2_TDM_TDM_TX_FSYNC0},
    {&CYHAL_TDM_0, P13_2, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_2_TDM_TDM_TX_FSYNC1},
    {&CYHAL_TDM_0, P16_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_0_TDM_TDM_TX_FSYNC1},
};

/* Connections for: tdm_tdm_tx_mck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_mck[3] = {
    {&CYHAL_TDM_0, P8_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_0_TDM_TDM_TX_MCK0},
    {&CYHAL_TDM_0, P13_0, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_0_TDM_TDM_TX_MCK1},
    {&CYHAL_TDM_0, P15_6, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_6_TDM_TDM_TX_MCK1},
};

/* Connections for: tdm_tdm_tx_sck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_sck[3] = {
    {&CYHAL_TDM_0, P8_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_1_TDM_TDM_TX_SCK0},
    {&CYHAL_TDM_0, P13_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_1_TDM_TDM_TX_SCK1},
    {&CYHAL_TDM_0, P15_7, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P15_7_TDM_TDM_TX_SCK1},
};

/* Connections for: tdm_tdm_tx_sd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_sd[3] = {
    {&CYHAL_TDM_0, P8_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P8_3_TDM_TDM_TX_SD0},
    {&CYHAL_TDM_0, P13_3, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P13_3_TDM_TDM_TX_SD1},
    {&CYHAL_TDM_0, P16_1, (uint8_t)CY_GPIO_DM_STRONG_IN_OFF, P16_1_TDM_TDM_TX_SD1},
};

#endif
